#define Функція ;
#define Метод ;
#define Клас class
#define повернути return
#define масив vector
#define константа const
#define авто auto
#define число int
#define публічно public
#define строка string
#define пустота void
#define цикл for
#define вивести cout
#define кінець endl
#define головна main
#define ґи 0

// Made by Jenia Deshchenko
#include <iostream>
#include <vector>

using namespace std;

Клас Час{
публічно:
    число год, хв, сек;
//публічно:
    константа число* години = &год;
    константа число* хвилини = &хв;
    константа число* секунди = &сек;

    Час(){
        год = хв = сек = 0;
    }
    Час(число години, число хвилини, число секунди){
        год = години;
        хв = хвилини;
        сек = секунди;
    }

    Метод пустота ПоказатиЧас(){
        вивести << "<" << год << ":" << хв << ":" << сек << ">";
    }

    Метод пустота ВстановитиДані(число години, число хвилини, число секунди){
        год = години;
        хв = хвилини;
        сек = секунди;
    }
};
// *Рейс?
Клас Поїзд : публічно Час{
публічно:
    число номер; строка напрям;
    Метод число ЗалишилосьХвилин(число години, число хвилини, число секунди){
        повернути (год*60 + хв + сек/60) - (години*60 + хвилини + секунди/60);
    }
};

Клас Розклад{
публічно:
    масив<Поїзд> поїзда;
    Розклад(масив<Поїзд> t){
        поїзда = t;
    }
    Метод пустота Показати(){
        цикл(константа авто поїзд: поїзда){
            cout << "Поїзд #" << поїзд.номер << " до " << поїзд.напрям << endl;
        }
    }
};

Функція число головна(пустота){
    Поїзд поїзд; поїзд.номер = 1; поїзд.напрям = "Нове Місто"; поїзд.ВстановитиДані(9, 45, 0);
    масив<Поїзд> поїзда;
    поїзда.push_back(поїзд);

    вивести << поїзд.ЗалишилосьХвилин(8, 25, 0) << кінець;

    Розклад розклад(поїзда);
    розклад.Показати();
    повернути ґи;
}
